---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteT
source: html/884cbd30-20f7-5ec2-958d-0713f731cdde.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteT

Defines parameters for parameterized concrete T structural section.

## Syntax (C#)
```csharp
public class StructuralSectionConcreteT : StructuralSectionRectangular
```